import React from "react";
import AboutModal from "./AboutModal";
const About = () => {
  return (
    <div className="about">
      <div className="about__modalsContainer">
        <AboutModal
          title="老人助養"
          desc="老人基金會自77年起，對散居各地的貧困無依老人展開關懷協助，二十餘年來協助個案累積逾數萬位，部分個案協助期約二十年。由於近年來社會福利制度已臻健全，低收入老人獲得政府生活補助，但仍有三種老人成為社會福利制度邊緣人，一：居住地點非戶籍所在地，無法獲得補助。二：已獲得補助，但不足以支付實際生活需求。三：子女未盡撫養義務，卻造成老人無法申請補助。由於助養工作係本會設立初衷，且許多老人多年來一直由本會照顧中，故助養組將堅定持續這項充滿愛心與感動的工作。"
        />
        <AboutModal
          title="老人防護"
          desc="老人基金會自81年起設置防護組，防制保護受虐老人。設立老人保護委員會，由五十八位立委和十七位學者擔任榮譽顧問，成立全省八處連絡處，與中央警察大學犯罪防治研究所合作「和諧專案」，以一萬五仟位勤區員警，運用戶口查察時機和平時對轄區瞭解，主動提報疑似受虐老人個案，每年均有二仟餘件。在媒體報導下，老人受虐逐漸受到重視，85年老人福利法修訂時，增加保護措施專章，以縣、市單位建立老人保護體系。中國人以敬老悌為傳統，對於子女無論身體、精神或經濟等方式的虐待，內心至為傷痛，常常自家人無法融和的事，基金會以第三者立場居中協調，卻出人意表的順利，主要在於大家仍然認為孝順父母是正確的事。"
        />
        <AboutModal
          title="老人協尋"
          desc="老人基金會自81年起設置防護組，防制保護受虐老人。設立老人保護委員會，由五十八位立委和十七位學者擔任榮譽顧問，成立全省八處連絡處，與中央警察大學犯罪防治研究所合作「和諧專案」，以一萬五仟位勤區員警，運用戶口查察時機和平時對轄區瞭解，主動提報疑似受虐老人個案，每年均有二仟餘件。在媒體報導下，老人受虐逐漸受到重視，85年老人福利法修訂時，增加保護措施專章，以縣、市單位建立老人保護體系。中國人以敬老悌為傳統，對於子女無論身體、精神或經濟等方式的虐待，內心至為傷痛，常常自家人無法融和的事，基金會以第三者立場居中協調，卻出人意表的順利，主要在於大家仍然認為孝順父母是正確的事。"
        />
        <AboutModal
          title="老人救援"
          desc="老人基金會自81年起設置防護組，防制保護受虐老人。設立老人保護委員會，由五十八位立委和十七位學者擔任榮譽顧問，成立全省八處連絡處，與中央警察大學犯罪防治研究所合作「和諧專案」，以一萬五仟位勤區員警，運用戶口查察時機和平時對轄區瞭解，主動提報疑似受虐老人個案，每年均有二仟餘件。在媒體報導下，老人受虐逐漸受到重視，85年老人福利法修訂時，增加保護措施專章，以縣、市單位建立老人保護體系。中國人以敬老悌為傳統，對於子女無論身體、精神或經濟等方式的虐待，內心至為傷痛，常常自家人無法融和的事，基金會以第三者立場居中協調，卻出人意表的順利，主要在於大家仍然認為孝順父母是正確的事。"
        />{" "}
        <AboutModal
          title="老人服務"
          desc="老人基金會自81年起設置防護組，防制保護受虐老人。設立老人保護委員會，由五十八位立委和十七位學者擔任榮譽顧問，成立全省八處連絡處，與中央警察大學犯罪防治研究所合作「和諧專案」，以一萬五仟位勤區員警，運用戶口查察時機和平時對轄區瞭解，主動提報疑似受虐老人個案，每年均有二仟餘件。在媒體報導下，老人受虐逐漸受到重視，85年老人福利法修訂時，增加保護措施專章，以縣、市單位建立老人保護體系。中國人以敬老悌為傳統，對於子女無論身體、精神或經濟等方式的虐待，內心至為傷痛，常常自家人無法融和的事，基金會以第三者立場居中協調，卻出人意表的順利，主要在於大家仍然認為孝順父母是正確的事。"
        />{" "}
        <AboutModal
          title="社會志工"
          desc="老人基金會自81年起設置防護組，防制保護受虐老人。設立老人保護委員會，由五十八位立委和十七位學者擔任榮譽顧問，成立全省八處連絡處，與中央警察大學犯罪防治研究所合作「和諧專案」，以一萬五仟位勤區員警，運用戶口查察時機和平時對轄區瞭解，主動提報疑似受虐老人個案，每年均有二仟餘件。在媒體報導下，老人受虐逐漸受到重視，85年老人福利法修訂時，增加保護措施專章，以縣、市單位建立老人保護體系。中國人以敬老悌為傳統，對於子女無論身體、精神或經濟等方式的虐待，內心至為傷痛，常常自家人無法融和的事，基金會以第三者立場居中協調，卻出人意表的順利，主要在於大家仍然認為孝順父母是正確的事。"
        />
      </div>

      <div
        className="about__image"
        style={{
          height: "100vh",
          width: "50%",
          backgroundSize: "cover",
          backgroundPosition: "center",
          backgroundImage: `url(${"https://images.pexels.com/photos/1786258/pexels-photo-1786258.jpeg?auto=compress&cs=tinysrgb&dpr=2&w=500"})`,
        }}
      ></div>
    </div>
  );
};

export default About;
